EnryGentile/Embedded-Secure-Gate-Controller/src/Remote_Controller/x-cube-subg1_firmware/STM32CubeExpansion_SUBG1_V3.3.0/Projects/STM32F401RE-NUCLEO/Applications/WMBusStandalone/S2LP-ConnectionApplyingTPL-Meter/Src/user_appli.c
/**
******************************************************************************
* @file    user_appli.c
* @author  SRA-NOIDA 
* @version V3.3.0
* @date    27-Apr-2021
* @brief   Source file for User application
*
******************************************************************************
* @attention
*
* <h2><center>&copy; COPYRIGHT(c) 2021 STMicroelectronics</center></h2>
*
* Redistribution and use in source and binary forms, with or without modification,
* are permitted provided that the following conditions are met:
*   1. Redistributions of source code must retain the above copyright notice,
*      this list of conditions and the following disclaimer.
*   2. Redistributions in binary form must reproduce the above copyright notice,
*      this list of conditions and the following disclaimer in the documentation
*      and/or other materials provided with the distribution.
*   3. Neither the name of STMicroelectronics nor the names of its contributors
*      may be used to endorse or promote products derived from this software
*      without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
* DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
* FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
* DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
* SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
* CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
* OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
* OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************
*/
/* Includes ------------------------------------------------------------------*/
#include <stdlib.h>
#include <string.h>
#include "user_appli.h"
#include "wmbus_phy.h"
#include "wmbus_link.h"
#include "wmbus_linkcommand.h"
#include "wmbus_tim.h"
#include "aes.h"
#include "uart.h"
#include "fifo.h"
#include "command.h"
#include "user_config.h"
#include "wmbus_link.h"

#ifdef USE_STM32F4XX_NUCLEO
#include "stm32f4xx_hal_gpio.h"
#endif

#ifdef USE_STM32L1XX_NUCLEO
#include "stm32l1xx_hal_gpio.h"
#endif

#ifdef USE_STM32L0XX_NUCLEO
#include "stm32l0xx_hal_gpio.h"
#endif





/**
* @addtogroup Application Application
* @{
*/

/**
* @addtogroup User Application    User Application
* @{
*/

/**
* @defgroup user_appli_Private_TypesDefinitions    User Application Private TypesDefinitions
* @{
*/

/**
*@}
*/


/**
* @defgroup user_appli_Private_Defines            User Application Private Defines
* @{
*/

/**
*@}
*/


/**
* @defgroup user_appli_Private_Macros          User Application Private Macros
* @{
*/

// General constant definitions
#define RF_TX_BUF_SIZE              300
#define RF_RX_BUF_SIZE              300

#define LF                          0x0a    // Linefeed character
#define CR                          0x0d    // Carriage return character

/**
*@}
*/

/**
* @defgroup user_appli_Private_Variables      User Application Private Variables
* @{
*/


__IO uint32_t DOWNStatus = 0x00, UPStatus = 0x00, SELStatus = 0x00,\
                     RIGHTStatus=0x00, LEFTStatus=0x00, KEYStatus=0x00;  

uint8_t AES_InitializationVector_Tx[INIT_VECTOR_SIZE] ={0};/*Tx Initialization vector*/
uint8_t AES_InitializationVector_Rx[INIT_VECTOR_SIZE] = {0};/*Rx Initialization vector*/

/* Following variables are used for implementing WMBus usage scenarios*/
uint8_t AlarmReqFlag = 0x00;
uint8_t DataReqFlag = 0x01;
uint8_t ResetLinkFlag = 0x00;
uint8_t SendData2Flag = 0x00;
uint8_t SendDataFlag = 0x00;
uint8_t CurrDataReqFlag = 0x00;
uint8_t CurrAlarmReqFlag = 0x00;
uint8_t CurrSendData2Flag = 0x00;
uint8_t ConfirmInstallFlag = 0;
/*Following Variable are used to generate random access number*/
uint8_t AccessNumber =  0x00;
uint8_t EllAccessNum = 0x00;
uint8_t UserDataBlock[20];
uint8_t PayloadSize = 0x08;/*Payload Size: defined by user*/
uint8_t PayloadBuffer[MAX_DATA_LEN] = {0};/*Payload Buffer: defined by user*/
//static __IO uint8_t CmdResponseFlow[8];
const uint8_t PktPayloadSize=16;
app_mode_t g_app_mode = APP_MODE_OPERATING;
uint8_t   g_cmd_buf_len = 0;
uint8_t    g_cmd_received = 0;
uint8_t    g_cmd_buf[CMD_BUF_SIZE];
OtherCmdFlag NxtCommandFlag;
OtherCmdFlag CurrCommandFlag;
uint8_t    g_mode = 1;
uint8_t    g_mode_prev = 1;
uint8_t    g_shutdown = 0;
uint8_t Flag  = 0;
uint8_t Buff[10] =  "HELLO";
volatile FlagStatus g_tx_done_flag = RESET;
volatile FlagStatus g_rx_done_flag = RESET;
static volatile uint8_t  g_rf_tx_timeout = 0;
//extern uint32_t g_escape_count;
CommandMode_TypedefEnum CommandMode = FIFO_INIT;

uint64_t GasMeterVol = 0;
//extern uint8_t VolumeIncFlag;

#pragma pack(4)
/*********************Default Payload Buffer: defined by user******************/
const uint8_t DefaultPayloadBuffer[MAX_DATA_LEN] = { 0x01,0x02,0x03,0x04,0x05,\
                                  0x06,0x07,0x08,0x09,0x0a,0x0b,0x0c,0x0e,0x0f,\
                                  0xff,0x02,0x02,0x03,0x04,0x05,0x06,0x07,0x08,\
                                  0x09,0x0a,0x0b,0x0c,0x0e,0x0f,0xff,0x03,0x02,\
                                  0x03,0x04,0x05,0x06,0x07,0x08,0x09,0x0a,0x0b,\
                                  0x0c,0x0e,0x0f,0xff,0x04,0x02,0x03,0x04,0x05,\
                                  0x06,0x07,0x08,0x09,0x0a,0x0b,0x0c,0x0e,0x0f,\
                                  0xff,0x05,0x02,0x03,0x04,0x05,0x06,0x07,0x08,\
                                  0x09,0x0a,0x0b,0x0c,0x0e,0x0f,0xff,0x06,0x02,\
                                  0x03,0x04,0x05,0x06,0x07,0x08,0x09,0x0a,0x0b,\
                                  0x0c,0x0e,0x0f,0xff,0x07,0x02,0x03,0x04,0x05,\
                                  0x06,0x07,0x08,0x09,0x0a,0x0b,0x0c,0x0e,0x0f,\
                                  0xff,0x08,0x02,0x03,0x04,0x05,0x06,0x07,0x08,\
                                  0x09,0x0a,0x0b,0x0c,0x0e,0x0f,0xff,0x09,0x02,\
                                  0x03,0x04,0x05,0x06,0x07,0x08,0x09,0x0a,0x0b,\
                                  0x0c,0x0e,0x0f,0xff,0x10,0x02,0x03,0x04,0x05,\
                                  0x06,0x07,0x08,0x09,0x0a,0x0b,0x0c,0x0e,0x0f,\
                                  0xff,0x11,0x02,0x03,0x04,0x05,0x06,0x07,0x08,\
                                  0x09,0x0a,0x0b,0x0c,0x0e,0x0f,0xff,0x12,0x02,\
                                  0x03,0x04,0x05,0x06,0x07,0x08,0x09,0x0a,0x0b,\
                                  0x0c,0x0e,0x0f,0xff,0x13,0x02,0x03,0x04,0x05,\
                                  0x06,0x07,0x08,0x09,0x0a,0x0b,0x0c,0x0e,0x0f,\
                                  0xff,0x14,0x02,0x03,0x04,0x05,0x06,0x07,0x08,\
                                  0x09,0x0a,0x0b,0x0c,0x0e,0x0f,0xff,0x15,0x02,\
                                  0x03,0x04,0x05,0x06,0x07,0x08,0x09,0x0a,0x0b,\
                                  0x0c,0x0e,0x0f,0xff,0x16,0x02,0x03,0x04,0x05,\
                                  0x06,0x07,0x08,0x09,0x0a,0x0b,0x0c,0x0e,0x0f,\
                                  0xff,0x17,0x02,0x03,0x04,0x05,0x06,0x07,0x08,\
                                  0x09,0x0a,0x0b,0x0c,0x0e,0x0f,0xff};

#pragma pack(4)
/****************************Default Meter Database****************************/
const MeterDataBase_t DefaultMeterDatabase=
{
  .DataPresentFlag = 0,
  .DeviceCount = 0x0000000A, 
  .MeterList = { 
    /************* METER 1 Data*************/
    {
      {0x8D,0x4E},
      {0x12,0x45,0x63,0x12},0x10,0x02,
      {0xc2,0x86,0x69,0x6d,0x88,0x7c,0x9a,0xa0,
      0x61,0x1b,0xbb,0x3e,0x20,0x25,0xa4,0x5a}
    },
    
