EnryGentile/Embedded-Secure-Gate-Controller/src/Remote_Controller/x-cube-subg1_firmware/STM32CubeExpansion_SUBG1_V3.3.0/Projects/STM32F401RE-NUCLEO/Applications/WMBusStandalone/S2LP-ConnectionApplyingTPL-Meter/Src/user_appli.c
    /************* METER 2 Data*************/      
    {
      {0x8D,0x4E},
      {0x11,0x45,0x63,0x17},0x10,0x02,
      {0x03,0x02,0x01,0x00,0x07,0x06,0x05,0x04,
      0x0b,0x0a,0x09,0x08,0x0f,0x0e,0x0d,0x0c}
    },
    
    /************* METER 3 Data*************/    
    {
      {0x8D,0x4E},
      {0x11,0x45,0x63,0x18},0x10,0x02,
      {0x0A,0x0B,0x0C,0x0D,0x0E,0x0F,0x10,0x11,
      0x12,0x13,0x014,0x15,0x16,0x17,0x18,0x19}
    },
    
    /************* METER 4 Data*************/
    {
      {0x8D,0x4E},
      {0x11,0x45,0x63,0x19},0x10,0x02,
      {0x0D,0x0B,0x0C,0x0D,0x0A,0x0F,0x13,0x11,
      0x12,0x13,0x01F,0x15,0x16,0x17,0x18,0x19}
    },
    
    /************* METER 5 Data*************/   
    {
      {0x8D,0x4E},
      {0x11,0x45,0x63,0x1A},0x10,0x02,
      {0x1A,0x1B,0x1C,0x1D,0x1E,0x1F,0x10,0x11,
      0x12,0x13,0x014,0x15,0x16,0x17,0x18,0x19}
    },
    
    /************* METER 6 Data*************/
    {
      {0x8D,0x4E},
      {0x11,0x45,0x63,0x1B},0x10,0x02,
      {0x2A,0x2B,0x2C,0x2D,0x2E,0x2F,0x20,0x11,
      0x12,0x13,0x014,0x15,0x16,0x17,0x18,0x19}
    },
    
    /************* METER 7 Data*************/
    {
      {0x8D,0x4E},
      {0x11,0x45,0x63,0x1C},0x10,0x02,
      {0x3A,0x3B,0x3C,0x3D,0x3E,0x3F,0x30,0x11,
      0x12,0x13,0x014,0x15,0x16,0x17,0x18,0x19}
    },
    
    /************* METER 8 Data*************/
    {
      {0x8D,0x4E},
      {0x11,0x45,0x63,0x1D},0x10,0x02,
      {0x4A,0x4B,0x4C,0x4D,0x4E,0x4F,0x40,0x11,
      0x12,0x13,0x014,0x15,0x16,0x17,0x18,0x19}
    },
    
    /************* METER 9 Data*************/   
    {
      {0x8D,0x4E},
      {0x11,0x45,0x63,0x1E},0x10,0x03,
      {0x5A,0x5B,0x5C,0x5D,0x5E,0x5F,0x50,0x11,
      0x12,0x13,0x014,0x15,0x16,0x17,0x18,0x19}
    },
    
    /************* METER 10 Data*************/
    {
      {0x8D,0x4E},
      {0x11,0x45,0x63,0x1F},0x10,0x04,
      {0x6A,0x6B,0x6C,0x6D,0x6E,0x6F,0x60,0x11,
      0x12,0x13,0x014,0x15,0x16,0x17,0x18,0x19}
    }   
  }
};
#pragma pack(4)
MeterDataBase_t MeterDatabase;  /*List of device infos of meters & Count in DB*/

#pragma pack(4)
DeviceInfo_t NewDevInfo =     {
      {0x8D,0x4E},
      {0x11,0x45,0x63,0x1F},0x10,0x04,
       {0x01,0x01,0x02,0x03,0x04,0x05,0x06,0x07,
      0x12,0x13,0x014,0x15,0x16,0x17,0x18,0x19}
    }  ;    /*Device info like Mfr, ID, Ver, Type, Enc Key*/

#pragma pack(4)
DeviceInfo_t ConcDevInfo = {
  
  {0x8D,0x4E},
  {0x12,0x45,0x63,0x12},0x10,0x02,
  {0xc2,0x86,0x69,0x6d,0x88,0x7c,0x9a,0xa0,
  0x61,0x1b,0xbb,0x3e,0x20,0x25,0xa4,0x5a}
};


/***************Application Attributes****************/
#pragma pack(4)
WMBusAppliAttributes  AppliAttr=  
{ .ELL_Len = 0,
  .SerialNum = 0x00000000,
  .CIField = CI_APPLI_RESET_NONE,
  .HeaderLength = NO_HEADER,
  .DevManufrID = {0x00,0x00},
  .DevID = {0x00,0x00,0x00,0x00},
  .DevVersion = 0x00,
  .MeterDevType = 0x00,
  .AccessNumber = 0x00,
  .Status = 0x00,
  .CONFIG_WORD ={0x0000},
  .EncKey = {0x00},
  .HardwareRev = 0x10,
  .FirmwareRev = 0x02000000, 
  .AckTimeout = 0x00,
  .FrequentAccessCycle = 0,
  .ELLType = ELL_0,
  .ELLAccessNum = 0x00
};


CfgParam_Typedef CurrCfg;

#ifdef DEVICE_TYPE_METER
#pragma pack(4)
CfgParam_Typedef CurrCfg = 
{
  .Flag = 1, 
  .ModuleFunction = 0,
  .DevType = METER,
  .Channel = DEVICE_WMBUS_CHANNEL,
  .FrameFormat = WMBUS_FRAME_FORMAT,
  .WorkingMode = DEVICE_WMBUS_MODE,
  .UartBaudRate = UART_BAUD_RATE,
  .EncrModeVar = 0xF0FF,
  .DevInfo.MfrID = {0x8D,0x4E},
  .DevInfo.IDNum = {0x11,0x45,0x63,0x1F},
  .DevInfo.Version = 0x10,
  .DevInfo.MeterType = 0x04,
  .DevInfo.EncrKey = {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
                      0x12,0x13,0x014,0x15,0x16,0x17,0x18,0x19}
                     
};

#endif


#ifndef DEVICE_TYPE_METER
#pragma pack(4)
CfgParam_Typedef CurrCfg = 
{
  .Flag = 1, 
  .ModuleFunction = 0,
  .DevType = OTHER,
  .Channel = DEVICE_WMBUS_CHANNEL,
  .FrameFormat = WMBUS_FRAME_FORMAT,
  .WorkingMode = DEVICE_WMBUS_MODE,
  .UartBaudRate = UART_BAUD_RATE,
  .EncrModeVar = 0xF0FF,
  .DevInfo.MfrID = {0x8D,0x4E},
  .DevInfo.IDNum = {0x11,0x45,0x63,0x1F},
  .DevInfo.Version = 0x10,
  .DevInfo.MeterType = 0x04,
  .DevInfo.EncrKey = {0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
                      0x12,0x13,0x014,0x15,0x16,0x17,0x18,0x19}
                     
};
#endif



/**
*@}
*/

/**
* @defgroup user_appli_Private_FunctionPrototypes     User Application Private FunctionPrototypes
* @{
*/

uint8_t GetDBMeterIndex(Frame_t  *rxFrame);

/**
*@}
*/


/**
* @defgroup user_appli_Private_Functions         User Application Private Functions
* @{
*/


/**
* @brief  This function will set the flags in order to send next command
* @param  OtherCmdFlag cmdflag : Command Flag
* @retval None.
*/
void SetNextCmdFlagOther(OtherCmdFlag nextCmdflag)
{
  switch(nextCmdflag)
  {
  case DATA_FLAG:
    DataReqFlag = 0x01;
    AlarmReqFlag = 0x00;
    SendDataFlag = 0x00;
    SendData2Flag = 0x00;
    ResetLinkFlag = 0x00;
    break;
  case ALARM_FLAG:
    DataReqFlag = 0x00;
    AlarmReqFlag = 0x01;
    SendDataFlag = 0x00;
    SendData2Flag = 0x00;
    ResetLinkFlag = 0x00;
    break;
  case SND_UD_FLAG:
    DataReqFlag = 0x00;
    AlarmReqFlag = 0x00;
    SendDataFlag = 0x01;
    SendData2Flag = 0x00;
    ResetLinkFlag = 0x00;
    break;
  case SND_UD2_FLAG:
    DataReqFlag = 0x00;
    AlarmReqFlag = 0x00;
    SendDataFlag = 0x00;
    SendData2Flag = 0x01;
    ResetLinkFlag = 0x00;
    break;
  case RESET_LINK_FLAG:
    DataReqFlag = 0x00;
    AlarmReqFlag = 0x00;
    SendDataFlag = 0x00;
    SendData2Flag = 0x00;
    ResetLinkFlag = 0x01;
    break;
  case RESET_ALL_FLAG:
    DataReqFlag = 0x00;
    AlarmReqFlag = 0x00;
    SendDataFlag = 0x00;
    SendData2Flag = 0x00;
    ResetLinkFlag = 0x00;
    break;
  default :
    DataReqFlag = 0x01;  
    AlarmReqFlag = 0x00;
    SendDataFlag = 0x00;
    SendData2Flag = 0x00;
    ResetLinkFlag = 0x00;
  }
}

/**
* @brief  This function will set the current command flag
* @param  OtherCmdFlag currCmdflag : Current command executed
* @retval None.
*/
void SetCurrCmdFlagOther(OtherCmdFlag currCmdflag)
{
  switch(currCmdflag)
  {
  case DATA_FLAG:
    CurrDataReqFlag = 0x01;
    CurrAlarmReqFlag = 0x00;
    CurrSendData2Flag = 0x00;
    break;
  case ALARM_FLAG:
    CurrDataReqFlag = 0x00;
    CurrAlarmReqFlag = 0x01;
    CurrSendData2Flag = 0x00;
    break;
  case SND_UD2_FLAG:
    CurrDataReqFlag = 0x00;
    CurrAlarmReqFlag = 0x00;
    CurrSendData2Flag = 0x01;
    break;
  default :
    break;
  }
}


/**
* @brief  This function will write Meter Database in Meter EEPROM
*         in Meter Database. 
* @param  None.
* @retval None.
*/
void WriteDeviceSelfinfoToEEPROM(void)
{
//  /*Write Device self info*/
//  WMBus_WriteDeviceInfoToEEPROM((uint8_t *)&CurrCfg.DevInfo,
//    sizeof(DeviceInfo_t), EEPROM_DEVINFO_START); 

