EnryGentile/Embedded-Secure-Gate-Controller/src/Remote_Controller/x-cube-subg1_firmware/STM32CubeExpansion_SUBG1_V3.3.0/Projects/STM32F401RE-NUCLEO/Applications/WMBusStandalone/S2LP-ConnectionApplyingTPL-Meter/Src/user_appli.c
}


/**
* @brief  This function will write New meter database in Concentrator EEPROM
* @param  None.
* @retval None.
*/
void WriteNewMeterDatabaseToEEPROM(DeviceInfo_t devInfo,uint16_t meterNum)
{
//  /*Write meter database*/
//   WMBus_WriteDeviceInfoToEEPROM((uint8_t *)&MeterDatabase,
//     sizeof(MeterDataBase_t), EEPROM_METERDB_START);

}


/**
* @brief  This function will write New meter database in Concentrator EEPROM
* @param  None.
* @retval None.
*/
void WriteConcDatabaseToEEPROM(void)
{
//  /*Write meter database*/
//   WMBus_WriteDeviceInfoToEEPROM((uint8_t *)&MeterDatabase,
//     sizeof(MeterDataBase_t), EEPROM_METERDB_START);
}



/**
* @brief  This function will write All database in Concentrator EEPROM
* @param  None.
* @retval None.
*/
void WriteDataBaseToEEPROM(void)
{
//  WMBus_WriteDeviceInfoToEEPROM((uint8_t *)&DefaultMeterDatabase,
//                                sizeof(DefaultMeterDatabase),
//                                DATABASE_START_ADDR);
    
}

/**
* @brief  This function will Erase All database in Concentrator EEPROM
* @param  None.
* @retval None.
*/
void EraseDataBaseFromEEPROM(void)
{
//  WMBus_EraseMeterDatabaseFromEEPROM1(DATABASE_START_ADDR,
//                                      sizeof(DefaultMeterDatabase));
   
}


/**
* @brief  This function will Read Concentrator EEPROM and put the data in the
*                      MeterDatabase structure.
* @param  None.
* @retval None.
*/
void UpdateMeterDatabaseFromEEPROM(void)
{
//  /*Read the meter database*/
//  WMBus_ReadDeviceInfoFromEEPROM((uint8_t*)&MeterDatabase,
//    sizeof(MeterDataBase_t), EEPROM_METERDB_START); 
}

/**
* @brief  This function writes the current configuration data to the EEPROM.
*         The purpose is to Load configuration even after Reset. 
* @param  None.
* @retval None.
*/
void WriteCurrentCfgToEEPROM(void)                                              
{
  //Write the parameters to be saved in the EEPROM 
  
//   /*Write The Parameter in the Database*/
//   WMBus_WriteDeviceInfoToEEPROM((uint8_t *)&CurrCfg,
//                                  sizeof(CurrCfg),
//                                  EEPROM_CURRENT_CFG_SADDRESS);
}


/**
* @brief  This function Reads the current configuration data from EEPROM Database.
*         The purpose is to Load configuration even after Reset. 
* @param  None.
* @retval None.
*/
void ReadCurrentCfgFromEEPROM(CfgParam_Typedef *Config)               
{
  
  //Update the parameters to be saved in the EEPROM 
  
//   /*Write The Parameter in the Database*/
//   WMBus_ReadDeviceInfoFromEEPROM((uint8_t *)Config,
//                                  sizeof(CfgParam_Typedef),
//                                  EEPROM_CURRENT_CFG_SADDRESS);
}

/**
* @brief  This function writes the Default configuration data to the EEPROM.
*         This will change the Default configuration (To be used carefully). 
* @param  None.
* @retval None.
*/
void WriteDefaultCfgToEEPROM(void)                                               
{
//  uint16_t numByte;
  //Update the parameters to be saved in the EEPROM 
  
//   /*Write The Parameter in the Database*/
//   WMBus_WriteDeviceInfoToEEPROM((uint8_t *)&DefaultCfg,
//                                  sizeof(DefaultCfg),
//                                  EEPROM_DEFAULT_CFG_SADDRESS);
}


/**
* @brief  This function reads the current configuration data from EEPROM Database.
*         The purpose is to Load configuration even after Reset. 
* @param  None.
* @retval None.
*/
void ReadDefaultCfgFromEEPROM(CfgParam_Typedef *defaultCfg)             
{

  //Update the parameters to be saved in the EEPROM 
  
//   /*Write The Parameter in the Database*/
//   WMBus_ReadDeviceInfoFromEEPROM((uint8_t *)defaultCfg,
//                                  sizeof(CfgParam_Typedef),
//                                  EEPROM_DEFAULT_CFG_SADDRESS);
}


#ifndef NO_EEPROM

void ManageCfgFromEEPROM(void)
{
  CfgParam_Typedef tempCfg;

//  if(OverWriteFlag)
#ifdef STORE_NVM_DEVINFO
    OverWriteCurrCfgToEEPROM(CurrCfg);
#endif  
  ReadCurrentCfgFromEEPROM(&tempCfg);
    
  if(tempCfg.Flag)/*If configuration is present in EEPROM*/
  {
     CurrCfg = tempCfg;
  }
  else  /*If No configuration is present in EEPROM*/
  {
   WriteCurrentCfgToEEPROM();
  }
}


void OverWriteCurrCfgToEEPROM(CfgParam_Typedef tempCfg)
{
    //Write the parameters to be saved in the EEPROM 
  
   /*Write The Parameter in the Database*/
//   WMBus_WriteDeviceInfoToEEPROM((uint8_t *)&tempCfg,
//                                  sizeof(tempCfg),
//                                  EEPROM_CURRENT_CFG_SADDRESS);
}


/**
* @brief  This function will Read Meter EEPROM and put the data in the
*                      MeterDataBase structure.
* @param  None.
* @retval None.
*/
void UpdateDeviceSelfInfoFromEEPROM(void)
{
//  /*Read the device self info*/
//    WMBus_ReadDeviceInfoFromEEPROM((uint8_t*)&CurrCfg.DevInfo,
//      sizeof(DeviceInfo_t), EEPROM_DEVINFO_START);
}

#endif
/**
* @brief  This function Sends the Firmware and Hardware Version to PC. 
* @param  None.
* @retval None.
*/
void GetVersion(void)             
{

  uart_sendDMA((uint8_t*)"\n",1);
  uart_sendDMA((uint8_t*)"HW VERSION: ",13);
  uart_sendDMA((uint8_t*)"V1",2);
  
  uart_sendDMA((uint8_t*)"\n",1);
  uart_sendDMA((uint8_t*)"FW VERSION: ",13);
  uart_sendDMA((uint8_t*)"V1.1",4);
  uart_sendDMA((uint8_t*)"\n",1);
 
}




/**
* @brief  This function will find out the serial number(Array Index)
*         in Meter Database. 
* @param  rxFrame: Recieved Frame.
* @retval If meter found in database then the index of the meter else 0xFF.
*/
uint8_t GetDBMeterIndex(Frame_t  *rxFrame)
{
  uint16_t count=0;
  uint8_t isSuccess=0;
  
  while(count<MeterDatabase.DeviceCount)
  {       
    if((MeterDatabase.MeterList[count].MfrID[0]==rxFrame->m_field[0]) &&\
      (MeterDatabase.MeterList[count].MfrID[1]==rxFrame->m_field[1]) &&\
        (MeterDatabase.MeterList[count].IDNum[0]==rxFrame->a_field[0]) &&\
          (MeterDatabase.MeterList[count].IDNum[1]==rxFrame->a_field[1]) &&\
            (MeterDatabase.MeterList[count].IDNum[2]==rxFrame->a_field[2]) &&\
              (MeterDatabase.MeterList[count].IDNum[3]==rxFrame->a_field[3]) &&\
                (MeterDatabase.MeterList[count].Version==rxFrame->a_field[4]) &&\
                  (MeterDatabase.MeterList[count].MeterType==rxFrame->a_field[5]))
    {
      isSuccess=1;
      break;
    }
    count++; 
  }
  if(isSuccess==1)
  {
    return count;
  }
  else
  {
    return 0xFF;
  }
}

/**
* @brief  This function will Initialize all Application Attributes 
*         defined by User
* @param  None.
* @retval None.
*/
void WMBUS_AppliAttrInit(uint8_t isDefault)
{
  uint16_t xTime = 3;
  uint16_t yTime = 2;
  
  /*Generating random access number*/
  srand(xTime);
  AccessNumber = rand()%255;
  
