EnryGentile/Embedded-Secure-Gate-Controller/src/Remote_Controller/x-cube-subg1_firmware/STM32CubeExpansion_SUBG1_V3.3.0/Projects/STM32F401RE-NUCLEO/Applications/WMBusStandalone/S2LP-ConnectionApplyingTPL-Meter/Src/user_appli.c
  srand(yTime);
  EllAccessNum = rand()%255;
  
  if (isDefault==0) return;
  
#ifdef STORE_NVM_DEVINFO
   if( CurrCfg.DevType == OTHER) 
  {
    CurrCfg.DevInfo = DefaultMeterDatabase.MeterList[0];
    CurrCfg.DevInfo.MeterType = COMMUNICATION_CONTROLLER; 
    MeterDatabase = DefaultMeterDatabase;
      
    WriteMeterDatabaseToEEPROM();                                               
  }
  else
  {
    CurrCfg.DevInfo = DefaultMeterDatabase.MeterList[METER_DB_INDEX];
  }
  /* Write Self info and Meter Database */
    WriteDeviceSelfinfoToEEPROM();                                                
#else
  /*Read self info and meter database*/
  if( CurrCfg.DevType == OTHER) 
  {
//    UpdateMeterDatabaseFromEEPROM();
  } 
#endif  
  
  /*Set WMBus Device Basic Info : Manfr Id, Identification, Version, metertype*/
  if( CurrCfg.DevType == METER) 
  {
    AppliAttr.SerialNum  = RF_ADAPTER_SER_NUM;/*RF Module Serial Number*/
    memcpy(AppliAttr.DevID, CurrCfg.DevInfo.IDNum,4);
    AppliAttr.MeterDevType = CurrCfg.DevInfo.MeterType;
  }
  else if( CurrCfg.DevType == OTHER) 
  {
    AppliAttr.SerialNum  = OTHER_SERIAL_NUM;
    memcpy(AppliAttr.DevID, CurrCfg.DevInfo.IDNum,4);
    AppliAttr.MeterDevType = CurrCfg.DevInfo.MeterType;
  }
  
  

  memcpy(AppliAttr.DevManufrID, CurrCfg.DevInfo.MfrID,2);
  AppliAttr.DevVersion = CurrCfg.DevInfo.Version;
  
  /************Set extended link layer info****************/
  if(AppliAttr.ELLType == ELL_I)
  {
    AppliAttr.ELL_Len = ELL_I;
  }
  else if(AppliAttr.ELLType == ELL_III)
  {
    AppliAttr.ELL_Len = ELL_III;
  }
  else
  {
    AppliAttr.ELL_Len = ELL_0; 
  }
  
  AppliAttr.ELLAccessNum = EllAccessNum;
  
  AppliAttr.CIField = CI_APPLI_RESET_NONE;
  AppliAttr.HeaderLength = NO_HEADER;
  AppliAttr.AccessNumber = AccessNumber;
  AppliAttr.Status = 0x00;

  /*Set used bits of CONFIG_WORD*/
  AppliAttr.CONFIG_WORD.Accessibility = 0x00;
  AppliAttr.CONFIG_WORD.BidirComm = 0x01;
  AppliAttr.CONFIG_WORD.Mode = 0x05;
  AppliAttr.CONFIG_WORD.NumEncrBlocks = 0x0F;
  AppliAttr.CONFIG_WORD.Synchronous = 0x00;
  
  /************Set Default Encryption Key****************/
  memcpy(AppliAttr.EncKey,CurrCfg.DevInfo.EncrKey,ENCKEY_LEN);
  
  AppliAttr.HardwareRev = 0x10;
  AppliAttr.FirmwareRev = 0x02000000;       
  AppliAttr.AckTimeout = ACK_TIMEOUT;
}

/**
* @brief  This function copies the application attributes required by the 
*              link layer
* @param  None
* @retval None .
*/
void WMBus_LinkSetAppliParams(void)
{
  uint16_t manfrID,devid;
  
  WMBusLinkAppliParams_t* linkAppliParams=WMBus_Link_GetAppliParameterPointer();
    
  linkAppliParams->LinkEllLength=AppliAttr.ELL_Len;
  linkAppliParams->LinkHeaderLength=AppliAttr.HeaderLength;
  
  manfrID =  (AppliAttr.DevManufrID[0]) |( AppliAttr.DevManufrID[1]<<8);
  devid = AppliAttr.DevID[0]| (AppliAttr.DevID[1]<<8)|\
         (AppliAttr.DevID[2]<<16)| (AppliAttr.DevID[3]<<24);/**((uint32_t*)(&AppliAttr.DevID));**/
    
  linkAppliParams->LinkManufrID = manfrID; /**(uint16_t*)(&AppliAttr.DevManufrID);**/
  linkAppliParams->LinkDeviceID = devid;  /**(uint32_t*)(&AppliAttr.DevID);       **/
  
  linkAppliParams->LinkDeviceVersion = AppliAttr.DevVersion;  
  linkAppliParams->LinkMeterType = AppliAttr.MeterDevType;
  
  linkAppliParams->LinkAccessNumber= AppliAttr.AccessNumber;
  linkAppliParams->LinkStatusField=AppliAttr.Status;

  memcpy(&linkAppliParams->LinkConfigWord,&AppliAttr.CONFIG_WORD,2);
/**  linkAppliParams->LinkConfigWord = *(uint16_t*)(&AppliAttr.CONFIG_WORD); **/
  linkAppliParams->LinkTimeout=AppliAttr.AckTimeout;
  linkAppliParams->LinkFreqAccessCycle=AppliAttr.FrequentAccessCycle;
  linkAppliParams->LinkEllType=AppliAttr.ELLType;
  linkAppliParams->LinkEllAccessNum=AppliAttr.ELLAccessNum;
}

/**
* @brief  This function will set the Application layer attribute value.
* @param  Input Param: APPLI_ATTR_ID attr  - The Appli attribute.
*                     uint32_t value   - The value of the attribute.
* @retval APPLI_STATUS : APPLI_STATUS_SUCCESS
*       APPLI_STATUS_INVALID_ATTR   - The attribute ID is invalid.
*       APPLI_STATUS_INVALID_ATTR_VAL   - The attribute value is invalid.
*       APPLI_STATUS_PHY_ERROR_READ_ONLY_ADDRESS   - The attribute is read only.
*                       
*/
APPLI_STATUS WMBus_AppliSetAttribute(APPLI_ATTR_ID attr, uint32_t value)
{
  switch(attr)
  {  
  case APPLI_ATTR_DEV_ID_NUM:
    memcpy(&AppliAttr.DevID[0], &value, 4);
    break;
    
  case APPLI_ATTR_DEV_MFR_ID:
     memcpy(&AppliAttr.DevManufrID[0], &value, 2);
    break;
    
  case APPLI_ATTR_DEV_VERSION:
    AppliAttr.DevVersion = (uint8_t)value;
    break;
    
  case APPLI_ATTR_METER_DEV_TYPE:
    AppliAttr.MeterDevType = (uint8_t)value;
    break;
    
  case APPLI_ATTR_ACCESS_NUM:
    AppliAttr.AccessNumber = (uint8_t)value;
    break;
    
  case APPLI_ATTR_STATUS_FIELD:
    AppliAttr.Status = (uint8_t)value;
    break;
    
  case APPLI_ATTR_CONFIG_WORD:
    memcpy(&AppliAttr.CONFIG_WORD, &value,2);
    break;  
    
  case APPLI_ATTR_ENCKEY:
    memcpy(&AppliAttr.EncKey[0], &value, ENCKEY_LEN);
    break; 
    
  case APPLI_ATTR_HW_REV:
    AppliAttr.HardwareRev = (uint8_t)value;
    break;  
    
  case APPLI_ATTR_SW_REV:
    AppliAttr.FirmwareRev = (uint32_t)value;
    break;
    
  case APPLI_ATTR_ACK_TIMEOUT:
    AppliAttr.AckTimeout = (uint32_t)value;
    break; 

  case APPLI_ATTR_FAC:
    AppliAttr.FrequentAccessCycle = (uint8_t)value;
    break;    

  case APPLI_ATTR_ELL_TYPE:
    AppliAttr.ELLType = (ExtendedLinkLayer_t)value;
    break;    
    
  default:
    return APPLI_STATUS_INVALID_ATTR;
  }
  return APPLI_STATUS_SUCCESS;
}


/**
* @brief  This function returns the Appli layer attributes 
* @param  Input Param: 1. APPLI_ATTR_ID attr  - The Appli attribute.
*                      2. uint32_t* value   - The value of the attribute.
* @retval APPLI_STATUS : APPLI_STATUS_SUCCESS
*       APPLI_STATUS_INVALID_ATTR   - The attribute ID is invalid.
*                       
*/
APPLI_STATUS WMBus_AppliGetAttribute(APPLI_ATTR_ID attr, uint32_t* value)
{ 
  switch(attr)
  {          
  case APPLI_ATTR_DEV_ID_NUM:
    memcpy(value, &AppliAttr.DevID,4);
    break;
    
  case APPLI_ATTR_DEV_MFR_ID:
    memcpy(value, &AppliAttr.DevManufrID,2);
    break;
    
  case APPLI_ATTR_DEV_VERSION:
    *value = (uint32_t)AppliAttr.DevVersion;
    break;
    
  case APPLI_ATTR_METER_DEV_TYPE:
    *value = (uint32_t)AppliAttr.MeterDevType;
    break;
    
