EnryGentile/Embedded-Secure-Gate-Controller/src/Remote_Controller/x-cube-subg1_firmware/STM32CubeExpansion_SUBG1_V3.3.0/Projects/STM32F401RE-NUCLEO/Applications/WMBusStandalone/S2LP-ConnectionApplyingTPL-Meter/Src/user_appli.c
  case APPLI_ATTR_ACCESS_NUM:
    *value = (uint32_t)AppliAttr.AccessNumber;
    break;
    
  case APPLI_ATTR_STATUS_FIELD:
    *value = (uint32_t)AppliAttr.Status;
    break;
    
  case APPLI_ATTR_CONFIG_WORD:
    memcpy(value, &AppliAttr.CONFIG_WORD,2);
    break;
    
  case APPLI_ATTR_ENCKEY:
    memcpy(value, &AppliAttr.EncKey[0], ENCKEY_LEN);
    break; 
    
  case APPLI_ATTR_HW_REV:
    *value = (uint32_t)AppliAttr.HardwareRev;
    break; 
    
  case APPLI_ATTR_SW_REV:
    *value = (uint32_t)AppliAttr.FirmwareRev;
    break;
    
  case APPLI_ATTR_ACK_TIMEOUT:
    *value = (uint32_t)AppliAttr.AckTimeout;
    break;
    
  case APPLI_ATTR_FAC:
    *value = (uint32_t)AppliAttr.FrequentAccessCycle;
    break;    

  case APPLI_ATTR_ELL_TYPE:
    *value = (uint32_t)AppliAttr.ELLType;
    break;
    
  default:
    return APPLI_STATUS_INVALID_ATTR;
  }
  return APPLI_STATUS_SUCCESS;
}


/**
* @brief  This function encrypts the meter data before sending to the other dev 
* @param  none.
* @retval 1 (success) or 0 (failure).
*/
////uint8_t EncryptMeterData(uint8_t *txPayloadSize)
////{
////  ConfigWordField configWord;
////  uint32_t tempAttr=0;
////  WMBus_AppliGetAttribute(APPLI_ATTR_CONFIG_WORD,  (uint32_t*)(&configWord));
////
////  if(configWord.Mode==ENCR_MODE_5)
////  {
////    WMBus_AppliGetAttribute(APPLI_ATTR_DEV_MFR_ID,  &tempAttr);
////    AES_InitializationVector_Tx[0] = (uint8_t)((tempAttr));
////    AES_InitializationVector_Tx[1] = (uint8_t)(tempAttr>>8);
////    
////    WMBus_AppliGetAttribute(APPLI_ATTR_DEV_ID_NUM,  &tempAttr);  
////    AES_InitializationVector_Tx[2] = ((uint8_t)tempAttr);
////    AES_InitializationVector_Tx[3] = (uint8_t)(tempAttr>>8);
////    AES_InitializationVector_Tx[4] = (uint8_t)(tempAttr>>16);
////    AES_InitializationVector_Tx[5] = (uint8_t)(tempAttr>>24);
////    
////    WMBus_AppliGetAttribute(APPLI_ATTR_DEV_VERSION,  &tempAttr);
////    AES_InitializationVector_Tx[6] = (uint8_t)(tempAttr);
////    
////    WMBus_AppliGetAttribute(APPLI_ATTR_METER_DEV_TYPE,  &tempAttr);
////    AES_InitializationVector_Tx[7] = (uint8_t)(tempAttr);
////    
////    WMBus_AppliGetAttribute(APPLI_ATTR_ACCESS_NUM,  &tempAttr);
////    AES_InitializationVector_Tx[8] = (uint8_t)(tempAttr);                                             
////    AES_InitializationVector_Tx[9] = (uint8_t)(tempAttr);                                            
////    AES_InitializationVector_Tx[10] = (uint8_t)(tempAttr);                                            
////    AES_InitializationVector_Tx[11] = (uint8_t)(tempAttr);                                           
////    AES_InitializationVector_Tx[12] = (uint8_t)(tempAttr);                                           
////    AES_InitializationVector_Tx[13] = (uint8_t)(tempAttr);                                           
////    AES_InitializationVector_Tx[14] = (uint8_t)(tempAttr);                                          
////    AES_InitializationVector_Tx[15] = (uint8_t)(tempAttr); 
////    
////    *txPayloadSize = WMBus_AppliEncrypt(CurrCfg.DevInfo.EncrKey,
////                                        AES_InitializationVector_Tx,
////                                        PayloadBuffer,
////                                        PayloadBuffer,
////                                        PayloadSize);
////    
////    configWord.NumEncrBlocks= *txPayloadSize / ENCR_BLOCK_SIZE;
////    WMBus_AppliSetAttribute(APPLI_ATTR_CONFIG_WORD,*((uint32_t*)(&configWord)));
////  }
////  return 1;
////}

/**
* @brief  This function encrypts other device data before sending to meter 
* @param  none.
* @retval 1 (success) or 0 (failure).
*/
////uint8_t EncryptConcData(uint8_t *txPayloadSize)
////{
////  uint8_t isSuccess=1; 
////  ConfigWordField configWord;
////  uint32_t tempAttr=0;
////  uint8_t meterIndex=0;
////  
////  WMBus_AppliGetAttribute(APPLI_ATTR_CONFIG_WORD,  (uint32_t*)(&configWord));
////
////  if(configWord.Mode==ENCR_MODE_5)
////  {
////    if(meterIndex!=0xFF)
////    {
////      WMBus_AppliGetAttribute(APPLI_ATTR_DEV_MFR_ID,  &tempAttr);
////      AES_InitializationVector_Tx[0] = (uint8_t)((tempAttr));
////      AES_InitializationVector_Tx[1] = (uint8_t)(tempAttr>>8);
////      
////      WMBus_AppliGetAttribute(APPLI_ATTR_DEV_ID_NUM,  &tempAttr);  
////      AES_InitializationVector_Tx[2] = ((uint8_t)tempAttr);
////      AES_InitializationVector_Tx[3] = (uint8_t)(tempAttr>>8);
////      AES_InitializationVector_Tx[4] = (uint8_t)(tempAttr>>16);
////      AES_InitializationVector_Tx[5] = (uint8_t)(tempAttr>>24);
////      
////      WMBus_AppliGetAttribute(APPLI_ATTR_DEV_VERSION,  &tempAttr);
////      AES_InitializationVector_Tx[6] = (uint8_t)(tempAttr);
////      
////      WMBus_AppliGetAttribute(APPLI_ATTR_METER_DEV_TYPE,  &tempAttr);
////      AES_InitializationVector_Tx[7] = (uint8_t)(tempAttr);
////      
////      WMBus_AppliGetAttribute(APPLI_ATTR_ACCESS_NUM,  &tempAttr);
////      AES_InitializationVector_Tx[8] = (uint8_t)(tempAttr);                                             
////      AES_InitializationVector_Tx[9] = (uint8_t)(tempAttr);                                            
////      AES_InitializationVector_Tx[10] = (uint8_t)(tempAttr);                                            
////      AES_InitializationVector_Tx[11] = (uint8_t)(tempAttr);                                           
////      AES_InitializationVector_Tx[12] = (uint8_t)(tempAttr);                                           
////      AES_InitializationVector_Tx[13] = (uint8_t)(tempAttr);                                           
////      AES_InitializationVector_Tx[14] = (uint8_t)(tempAttr);                                          
////      AES_InitializationVector_Tx[15] = (uint8_t)(tempAttr); 
////      
////      *txPayloadSize  = WMBus_AppliEncrypt(MeterDatabase.MeterList[meterIndex].EncrKey,
////                                           AES_InitializationVector_Tx,                                       
////                                           PayloadBuffer ,
////                                           PayloadBuffer ,
////                                           PayloadSize);
////    configWord.NumEncrBlocks= *txPayloadSize / ENCR_BLOCK_SIZE;
////    WMBus_AppliSetAttribute(APPLI_ATTR_CONFIG_WORD,  *((uint32_t*)(&configWord)));
////    }
////    else
////    {
////      /*Error : Meter not in database*/
////      isSuccess=0;
////    }
////  } 
////  return isSuccess;
////}

/**
* @brief  This function decrypts the data received at concentrator side
* @param  Frame *frame.
* @retval 1 (success) or 0 (failure).
*/
////uint8_t DecryptConcData(Frame_t * frame)
////{
////  uint8_t isSuccess=1;
////  ConfigWordField configWord;
////  uint8_t meterIndex=0;
////  
////  WMBus_AppliGetAttribute(APPLI_ATTR_CONFIG_WORD,  (uint32_t*)(&configWord));
////  
////  if(configWord.Mode==ENCR_MODE_5)
////  {  
////    AES_InitializationVector_Rx[0] = frame->m_field[0]; /*lsb of manufacture id*/ 
////    AES_InitializationVector_Rx[1] = frame->m_field[1]; /*msb of manufacure id*/
////    AES_InitializationVector_Rx[2] = frame->a_field[0];
////    AES_InitializationVector_Rx[3] = frame->a_field[1];
////    AES_InitializationVector_Rx[4] = frame->a_field[2];
////    AES_InitializationVector_Rx[5] = frame->a_field[3];
////    AES_InitializationVector_Rx[6] = frame->a_field[4];
////    AES_InitializationVector_Rx[7] = frame->a_field[5];
////    AES_InitializationVector_Rx[8] = frame->data_field.header.accessNum;
////    AES_InitializationVector_Rx[9] = frame->data_field.header.accessNum;
////    AES_InitializationVector_Rx[10] = frame->data_field.header.accessNum;
////    AES_InitializationVector_Rx[11] = frame->data_field.header.accessNum;
////    AES_InitializationVector_Rx[12] = frame->data_field.header.accessNum;
////    AES_InitializationVector_Rx[13] = frame->data_field.header.accessNum;
////    AES_InitializationVector_Rx[14] = frame->data_field.header.accessNum;
////    AES_InitializationVector_Rx[15] = frame->data_field.header.accessNum;
////    
////    meterIndex = GetDBMeterIndex(frame);
////    if(meterIndex!=0xFF)
////    {
////      WMBus_AppliDecrypt(MeterDatabase.MeterList[meterIndex].EncrKey,
////                         AES_InitializationVector_Rx,       
////                         frame->data_field.payload,
////                         frame->data_field.payload,
////                         frame->data_field.size);
////    }
////    else
////    {
////      /*Error : Meter not in database*/
////      isSuccess=0;
////    }
////  }
////  return isSuccess;
////}

/**
* @brief  This function decrypts the data received at meter side. 
* @param  Frame *frame.
* @retval 1 (success) or 0 (failure).
*/
////uint8_t DecryptMeterData(Frame_t * frame)
////{
////  ConfigWordField configWord;
////  
////  WMBus_AppliGetAttribute(APPLI_ATTR_CONFIG_WORD,  (uint32_t*)(&configWord));
////
////  if(configWord.Mode==ENCR_MODE_5)
////  {
////    AES_InitializationVector_Rx[0] = frame->m_field[0]; /*lsb of manufacture id*/ 
////    AES_InitializationVector_Rx[1] = frame->m_field[1]; /*msb of manufacure id*/
////    AES_InitializationVector_Rx[2] = frame->a_field[0];
////    AES_InitializationVector_Rx[3] = frame->a_field[1];
////    AES_InitializationVector_Rx[4] = frame->a_field[2];
////    AES_InitializationVector_Rx[5] = frame->a_field[3];
////    AES_InitializationVector_Rx[6] = frame->a_field[4];
////    AES_InitializationVector_Rx[7] = frame->a_field[5];
////    
////    AES_InitializationVector_Rx[8] =  frame->data_field.header.accessNum;
////    AES_InitializationVector_Rx[9] =  frame->data_field.header.accessNum;
////    AES_InitializationVector_Rx[10] = frame->data_field.header.accessNum;
////    AES_InitializationVector_Rx[11] = frame->data_field.header.accessNum;
////    AES_InitializationVector_Rx[12] = frame->data_field.header.accessNum;
////    AES_InitializationVector_Rx[13] = frame->data_field.header.accessNum;
////    AES_InitializationVector_Rx[14] = frame->data_field.header.accessNum;
////    AES_InitializationVector_Rx[15] = frame->data_field.header.accessNum;
////    
////    
////    WMBus_AppliDecrypt(CurrCfg.DevInfo.EncrKey,
////                       AES_InitializationVector_Rx,
////                       frame->data_field.payload,
////                       frame->data_field.payload,
////                       frame->data_field.size);
////  }
////  return 1;
////}

/**
* @brief  This routine updates the respective status for key press.
* @param  None
* @retval None
*/
void Set_KeyStatus(void)
{
  KEYStatus=1;
}

/**
* @brief  This routine updates the respective status for SEL key press.
* @param  None
* @retval None
*/
void Set_SELStatus(void)
{
  SELStatus = 1;
}

/**
* @brief  This routine updates the respective status for Down key press.
* @param  None
* @retval None
*/
void Set_DOWNStatus()
{
  DOWNStatus=1;
}

/**
* @brief  This routine updates the respective status for Up key press.
* @param  None
* @retval None
*/
void Set_UPStatus(void)
{
  UPStatus=1;
}

/**
* @brief  This routine updates the respective status for Right key press.
* @param  None
* @retval None
*/
void Set_RightStatus(void)
{
  RIGHTStatus=1;
}

/**
* @brief  This routine updates the respective status for Left key press.
* @param  None
* @retval None
*/
void SetLeftKeyStatus(void)
{
  LEFTStatus=1;
}


/**
* @brief  This function will write all meter database in Concentrator EEPROM
* @param  None.
* @retval None.
*/
void WriteMeterDatabaseToEEPROM(void)
{
//  /*Write meter database*/
//   WMBus_WriteDeviceInfoToEEPROM((uint8_t *)&MeterDatabase,
//     sizeof(MeterDataBase_t), EEPROM_METERDB_START);
}

/******************************************************************************/
/**
 * @brief Handle the activity LED timer callback.
 *
 * This function handles the activity LED timer callback when the LED timer
 * expires. This ensures that the LED is turned off after being previously
 * being turned on when data was received or transmitted by the S2LP.
 */
void app_tx_rx_led_timer_fn(void)
{
    app_tx_rx_led_off();
}

/******************************************************************************/
/**
 * @brief Handle the transmit delay timer callback.
 *
 * This function handles the TX delay timer callback when the timer expires.
 */
void app_rf_tx_delay_timer_fn(void)
{
    g_rf_tx_timeout = 1;
}



/******************************************************************************/
/**
 * @brief Function to turn the TX TX LED off
 */
void app_tx_rx_led_off(void)
{
////    if (config_get()->tx_rx_led == 2)
////    {
////        gpio_set_state(LED_PORT, LED_PIN, 0);
////    }
////    else
////    {
////        gpio_set_state(LED_PORT, LED_PIN, 1);
////    }
}



/******************************************************************************/
/**
 * @brief The application command mode loop.
 */
void app_command_mode(void)
{

  if((CurrCfg.ModuleFunction == WMBUS_FUNCT) || (CurrCfg.ModuleFunction == SNIFFER_FUNCT))
  {
  switch(CommandMode)
  {
    
  case FIFO_INIT:
    fifo_init(g_p_uart_rx_fifo);
    
