EnryGentile/Embedded-Secure-Gate-Controller/src/Remote_Controller/x-cube-subg1_firmware/STM32CubeExpansion_SUBG1_V3.3.0/Projects/STM32F401RE-NUCLEO/Applications/WMBusStandalone/S2LP-ConnectionApplyingTPL-Meter/Src/user_appli.c
    CommandMode = FIFO_PROCESS;
      
    break;
    
  case FIFO_PROCESS:
    
    app_process_uart_rx_fifo();
    
    if(g_cmd_received)
      CommandMode = FIFO_PROCESS_COMMAND;
    
    break;
    
  case FIFO_PROCESS_COMMAND:
    cmd_process(g_cmd_buf, g_cmd_buf_len);
    
    if(g_cmd_received == 0)
      CommandMode = FIFO_CLEAR_COMMAND;
    
    break;
    
  case FIFO_CLEAR_COMMAND:
    app_clear_command_buffer();
    
    CommandMode = FIFO_INIT;
    
    break;
       
  default:
    break;
    
  }
  }
}



/******************************************************************************/
/**
 * @brief Process data received from the uart, from the rx fifo.
 */
void app_process_uart_rx_fifo(void)
{
    uint8_t rx = 0;
    
    if (fifo_dequeue(g_p_uart_rx_fifo, &rx))
    {
        // Convert character to upper case
        if ((rx >= 'a') && (rx <= 'z'))
        {
            rx = rx + 'A' - 'a';
        }

        if (rx != LF)
        {
            if (g_cmd_buf_len == CMD_BUF_SIZE)
            {
                g_cmd_buf_len = 0;
            }

            g_cmd_buf[g_cmd_buf_len++] = rx;

            if (rx == CR)
            {
                g_cmd_received = 1;
            }
        }
    }
}


/******************************************************************************/
/**
 * @brief Clear the command buffer for the UART interface.
 *
 * This function is called to clear the command buffer for data received on
 * the UART interface, after the data has been processed.
 */
void app_clear_command_buffer(void)
{
    memset((uint8_t*)g_cmd_buf, 0, CMD_BUF_SIZE);
    g_cmd_buf_len = 0;
}

/******************************************************************************/
/**
 * @brief Send a response string on the UART interface.
 *
 * This function wraps the UART send function and calculates the string length
 * to avoid having to specify it.
 *
 * @param  p_response  The NULL terminated response string to send.
 */
void app_send_response(const char* p_response)
{
  uart_sendDMA((uint8_t*)p_response, strlen(p_response));
}


/******************************************************************************/
/**
 * @brief Function to turn the TX TX LED on
 */
void app_tx_rx_led_on(void)
{
//    if (config_get()->tx_rx_led == 2)
//    {
//        gpio_set_state(LED_PORT, LED_PIN, 1);
//    }
//    else
//    {
//        gpio_set_state(LED_PORT, LED_PIN, 0);
//    }
}




/******************************************************************************/
/**
 * @brief Initialize the txrx LED into its configured state.
 */
void app_init_txrx_led(void)
{
//    if (config_get()->tx_rx_led == 2)
//    {
//        gpio_config(LED_PORT, LED_PIN, GPIO_PP);
//        gpio_set_state(LED_PORT, LED_PIN, 0);
//    }
//    else
//    {
//        gpio_config(LED_PORT, LED_PIN, GPIO_OD);
//        gpio_set_state(LED_PORT, LED_PIN, 1);
//    }
}

/******************************************************************************/
/**
 * @brief Set the application mode, generally operating mode or command mode.
 *
 * @param  mode  The app mode to set.
 */
void app_set_mode(app_mode_t mode)
{
    if ((mode == APP_MODE_COMMAND) || 
        (mode ==  APP_MODE_OPERATING) ||
        (mode == APP_MODE_MTC))
    {
        g_app_mode = mode;
    }
    else
    {
//        assert(0);                                                            
    }
}


/******************************************************************************/
/**
 * @brief Process mode switching triggered by the mode pin.
 */
void app_process_mode_switch()
{
   if (g_mode != g_mode_prev)
    {
        g_mode_prev = g_mode;
        
        if (g_mode)
        {
            if (g_app_mode == APP_MODE_OPERATING)
            {
                g_app_mode = APP_MODE_COMMAND;
            }
        }
        else
        {
            if (g_app_mode == APP_MODE_COMMAND)
            {
                g_app_mode = APP_MODE_OPERATING;
            }
        }
    }
}


#ifdef  USE_FULL_ASSERT
/**
* @brief  Reports the name of the source file and the source line number
*         where the assert_param error has occurred.
* @param file: pointer to the source file name
* @param line: assert_param error line source number
* @retval : None
*/
void assert_failed(uint8_t* file, uint32_t line)
{
  /* User can add his own implementation to report the file name and line number */
  printf("Wrong parameters value: file %s on line %d\r\n", file, line);
  
  /* Infinite loop */
  while (1)
  {
  }
}
#endif

/**
*@}
*/

/**
*@}
*/

/**
*@}
*/

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
